Repository: cloudguy/Storage-Monster
Catalog: StorageMonster.Web/Properties/ValidationResources.*.resx
Languages: ru

# AccountExistsError
source: Account already exists
ru: Учетная запись уже существует

# AccountInvalidError
source: Invalid account
ru: Неправильная учетна запись

source: Account not found
ru: Профиль не найден

# AccountStalled
source: Account was already updated
ru: Профиль был обновлен ранее

# AjaxAccessDenied
source: Access denied
ru: Доступ запрещен

# AjaxNotAcceptable
source: Request is not acceptable
ru: Невозможно обработать запрос

# AjaxNotFound
source: Request can not be processed (404)
ru: Запрос не может быть обработан (404)

# AjaxServerError
source: Server error
ru: Ошибка сервера

# AntiforgeryMismath
source: Bad request
ru: Неправильный запрос

# BadRequestError
source: Request is not accepatble
ru: Невозможно обработать запрос

# EmailNotFoundError
source: Specified email was not found
ru: Указанный почтовый ящик не найден

# InvalidFieldFormat
source: Field '{0}' is invalid.
ru: Поле '{0}' заполнено неверно.

# InvalidFileLocation
source: File location is invalid
ru: Неправильное расположение файла

# NoPermissionsError
source: You have no permissions to view this page
ru: У вас нет прав для просмотра данной страницы

# NoPermissionsToDownload
source: You have no permissions to download file
ru: У вас нет прав для загрузки файла

# OldPasswordsMismatchError
source: Old password is incorrect
ru: Старый пароль указан не верно

# PasswordMinLengthFormat
source: Field '{0}' is required to be a minimum of {1} character(s) in length.
ru: Поле '{0}' должно содержать как минимум {1} символа(ов).

# PasswordsMustMatch
source: Paswords must match.
ru: Пароли должны совпадать.

# RegDuplicateEmail
source: Specified e-mail address already exists. Please enter a different e-mail address.
ru: Пользователь с таким почтовым ящиком уже существует.

# RegDuplicateUserName
source: Username already exists. Please enter a different user name.
ru: Пользователь с таким именем уже существует.

# RegInvalidAnswer
source: The password retrieval answer provided is invalid. Please check the value and try again.
ru: Ответ для восстановления пароля указан неверно.

# RegInvalidEmail
source: The e-mail address provided is invalid. Please check the value and try again.
ru: Неправильно указан почтовый ящик.

# RegInvalidPassword
source: The password provided is invalid. Please enter a valid password value.
ru: Неверно введен пароль.

# RegInvalidQuestion
source: The password retrieval question provided is invalid. Please check the value and try again.
ru: Вопрос для восстановления пароля указан неверно.

# RegInvalidUserName
source: The user name provided is invalid. Please check the value and try again.
ru: Неправильно указано имя пользователя.

# RegProviderError
source: The authentication provider returned an error. Internal error. If the problem persists, please contact your system administrator.
ru: Ошибка регистрации. Системная ошибка. Если ошибка остается, свяжитесь с системным администратором.

# RegUnknownError
source: An unknown error occurred. Please verify your entry and try again. If the problem persists, please contact your system administrator.
ru: Неизвестная ошибка. Проверьте введенные поля. Если ошибка остается, свяжитесь с системным администратором.

# RegUserRejected
source: The user creation request has been canceled. Please verify your entry and try again. If the problem persists, please contact your system administrator.
ru: Отказано в создании нового пользователя. Проверьте введенные поля. Если ошибка остается, свяжитесь с системным администратором.

# RequiredFieldFormat
source: Field '{0}' is required.
ru: Отсутствует обязательное поле '{0}'.

# ResetInstructionSendingFailedError
source: Server error
ru: Ошибка сервера

# StampRequired
source: Bad request
ru: Неправильный запрос

# StorageAccountNotFoundError
source: Storage account not found
ru: Учетная запись хранилища не найдена

# StorageAccountStalled
source: Account was already updated by someone else
ru: Учетная запись была кем-то обновлена ранее

# StoragePluginNotFoundError
source: Storage type not found
ru: Тип хранилища не найден

# StringLengthFormat
source: Field '{0}' must be not more than {2} characters and note less than {1} characters
ru: Поле '{0}' должно быть не больше, чем {2} символа(ов) и не меньше, чем {1} символа(ов)

# StringLengthLessThanFormat
source: Field '{0}' must be not more than {2} characters
ru: Поле '{0}' должно быть не больше, чем {2} символа(ов)

# UserNameOrPasswordIncorrect
source: The username or password provided is incorrect.
ru: Неправильно указан почтовый ящик или пароль.

# UserNotFoundError
source: User not found
ru: Пользователь не найден
